src/Catalogs/ТорговыеТочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТорговыеТочки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОтказВОкнеПоставщика</Name>
					<Comment>Для окна поставщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаОбновлятьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>для покупателя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПоставки</Name>
					<Comment>для поставщика</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПоставки2</Name>
					<Comment>для сайта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказРавенПриходу</Name>
					<Comment>Для окна поставщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодWMS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсVMI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтклоненияЦенПрихода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаетСОкномПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флВыгружать_Заказ_вДрБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоотправкаОтгрузочныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоотправкаОтгрузочныхДокументовСКомментариями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоотправкаОтгрузочныхДокументовНеАрхивировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКомментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийФинансовогоОтдела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Марки</v8:Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутыДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МаршрутДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ФилиалыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФилиалыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ТорговыеТочки/Ext/ObjectModule.bsl
Перем ЗарегистрироватьВОбмене_ДляСайта;
Перем ЗарегистрироватьВОбмене;

Перем ЗарегистрироватьВОбмене_ОбменПартКом83_77;

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ЗарегистрироватьВОбмене = Истина;
	Иначе
		ЗарегистрироватьВОбмене =	Владелец <> Ссылка.Владелец ИЛИ
									Код <> Ссылка.Код Или
									ВРЕГ(СокрЛП(Наименование)) <> ВРЕГ(СокрЛП(Ссылка.Наименование));
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьВОбмене_ДляСайта =	ГородПоставки <> Ссылка.ГородПоставки ИЛИ
										ГородПоставки2 <> Ссылка.ГородПоставки2;
	
	Если ТекущаяДата() > Константы.ДатаЗаявкиСоздаютсяВ83.Получить() Тогда
		ЗарегистрироватьВОбмене_ОбменПартКом83_77 = Истина;
	КонецЕсли;
	
	
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(Владелец) И ОбщегоНазначения.СсылкаСуществует(Владелец) тогда
		лРеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "Код,ОсновнаяТорговаяТочка");
		Если (лРеквизитыВладельца.ОсновнаяТорговаяТочка = Ссылка) тогда
			Если (лРеквизитыВладельца.Код <> Код) тогда
				// надо изменить код контрагента, потому что изменился код основной торговой точки
				лОбъект = Владелец.ПолучитьОбъект();
				лОбъект.Код = Код;
				лОбъект.ОбменДанными.Загрузка = Истина;
				лОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	МаршрутыДоставки.Очистить();
	Если ЗначениеЗаполнено(МаршрутДоставки) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки;
	КонецЕсли;
	Если ЗначениеЗаполнено(МаршрутДоставки2) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки2;
	КонецЕсли;
	Если ЗначениеЗаполнено(МаршрутДоставки3) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки3;
	КонецЕсли;
	
	Если ЗарегистрироватьВОбмене Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьКОбменуБИТ(Ссылка, ОбменДанными.Отправитель);
	КонецЕсли;
	
	Если ЗарегистрироватьВОбмене_ДляСайта Тогда
		ПланыОбмена.ОбменПартКом83_Сайт.ЗарегистрироватьВОбмен(Владелец);
	КонецЕсли;
	
	_Филиал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регион, "Филиал");
	
	Если ЗначениеЗаполнено(_Филиал) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ФилиалыТорговыхТочек.ТорговаяТочка,
		|	ФилиалыТорговыхТочек.Филиал
		|ИЗ
		|	РегистрСведений.ФилиалыТорговыхТочек КАК ФилиалыТорговыхТочек
		|ГДЕ
		|	ФилиалыТорговыхТочек.ТорговаяТочка = &ТорговаяТочка");
		Запрос.УстановитьПараметр("ТорговаяТочка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			МЗ = РегистрыСведений.ФилиалыТорговыхТочек.СоздатьМенеджерЗаписи();
			МЗ.ТорговаяТочка = Ссылка;
			МЗ.Филиал = _Филиал;
			МЗ.Записать();
			
		Иначе
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			_ФилиалВРегистре = Выборка.Филиал;
			
			Если _ФилиалВРегистре <> _Филиал Тогда
				
				МЗ = РегистрыСведений.ФилиалыТорговыхТочек.СоздатьМенеджерЗаписи();
				МЗ.ТорговаяТочка = Ссылка;
				МЗ.Филиал = _Филиал;
				МЗ.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗарегистрироватьВОбмене_ОбменПартКом83_77 тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_77.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

ЗарегистрироватьВОбмене_ДляСайта = Ложь;
ЗарегистрироватьВОбмене_ОбменПартКом83_77 = Ложь;
